In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../pandas_data/employees.csv')

In [4]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [6]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [7]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services

In [8]:
df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

In [9]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-05-31 11:17:00,130590,11.858,False,Finance

In [10]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

In [12]:
df['Gender'] = df['Gender'].astype('category')

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [14]:
df = pd.read_csv('../pandas_data/employees.csv', parse_dates=['Start Date','Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-05-31 11:17:00,130590,11.858,False,Finance

In [18]:
df[df['Gender'] == "Male"]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2021-05-31 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-05-31 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2021-05-31 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2021-05-31 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2021-05-31 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2021-05-31 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2021-05-31 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2021-05-31 18:24:00,129949,10.169,True,Sales

In [25]:
condition = df['Team'] == 'Finance'

df[condition]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2021-05-31 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-05-31 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2021-05-31 10:43:00,45906,11.598,True,Finance
14,Kimberly,Female,1999-01-14,2021-05-31 07:13:00,41426,14.543,True,Finance
46,Bruce,Male,2009-11-28,2021-05-31 22:47:00,114796,6.796,False,Finance
...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,2021-05-31 11:12:00,137144,10.081,False,Finance
954,Joe,Male,1980-01-19,2021-05-31 16:06:00,119667,1.148,True,Finance
987,Gloria,Female,2014-12-08,2021-05-31 05:08:00,136709,10.331,True,Finance
992,Anthony,Male,2011-10-16,2021-05-31 08:35:00,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,2021-05-31 06:30:00,42392,19.675,False,Finance

In [28]:
df[df['Senior Management']]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2021-05-31 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-05-31 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2021-05-31 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2021-05-31 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2021-05-31 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2021-05-31 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2021-05-31 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2021-05-31 18:24:00,129949,10.169,True,Sales

In [30]:
df[df['Team'] != 'Marketing']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-05-31 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-05-31 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-05-31 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2021-05-31 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2021-05-31 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2021-05-31 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2021-05-31 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2021-05-31 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2021-05-31 18:24:00,129949,10.169,True,Sales

In [53]:
df[df['Salary'] > 110000]
df[df['Bonus %'] < 1.5].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
4,Larry,Male,1998-01-24,2021-05-31 16:47:00,101004,1.389,True,Client Services
15,Lillian,Female,2016-06-05,2021-05-31 06:09:00,59414,1.256,False,Product
58,Theresa,Female,2010-04-11,2021-05-31 07:18:00,72670,1.481,True,Engineering
77,Charles,Male,2004-09-14,2021-05-31 20:13:00,107391,1.260,True,Marketing
175,Willie,Male,1998-02-17,2021-05-31 20:20:00,146651,1.451,True,Engineering

In [45]:
condition = df['Start Date'] <= '1985-01-01'
df[condition]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2021-05-31 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2021-05-31 01:08:00,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,2021-05-31 10:27:00,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,2021-05-31 18:30:00,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,2021-05-31 20:49:00,57427,9.557,True,Client Services
...,...,...,...,...,...,...,...,...
982,Rose,Female,1982-04-06,2021-05-31 10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,2021-05-31 22:35:00,146907,11.738,False,Engineering
985,Stephen,NaN,1983-07-10,2021-05-31 20:10:00,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,2021-05-31 07:04:00,82871,17.999,False,Marketing
996,Phillip,Male,1984-01-31,2021-05-31 06:30:00,42392,19.675,False,Finance

In [46]:
# Filter with More then one condition (AND)

In [51]:
condition1 = df['Gender'] == 'Male'
condition2 = df['Team'] == 'Marketing'
df[condition1 & condition2].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2021-05-31 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2021-05-31 07:45:00,37598,7.757,True,Marketing

In [52]:
# Filter with More than One Condition (OR)

In [54]:
df = pd.read_csv('../pandas_data/employees.csv', parse_dates=['Start Date','Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-05-31 11:17:00,130590,11.858,False,Finance

In [60]:
condition1 = df['Senior Management']
condition2 = df['Start Date'] < '1990-01-01'
df[condition1 | condition2].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-05-31 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2021-05-31 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-05-31 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2021-05-31 01:35:00,115163,10.125,False,Legal

In [64]:
condition1 = df['First Name'] == 'Robert'
condition2 = df['Team'] == 'Client Services'
condition3 = df['Start Date'] == '2016-06-01'

In [65]:
df[(condition1 & condition2) | condition3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
387,Robert,Male,1994-10-29,2021-05-31 04:26:00,123294,19.894,False,Client Services

In [66]:
# The .isin() Method

In [70]:
condition1 = df['Team'] == "Legal"
condition2 = df['Team'] == "Sales"
condition3 = df['Team'] == "Product"

In [79]:
df[condition1 | condition2 | condition3]
condition = df['Team'].isin(['Legal','Product','Marketing']) # Best practice

df[condition]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-05-31 12:42:00,97308,6.945,True,Marketing
5,Dennis,Male,1987-04-18,2021-05-31 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2021-05-31 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2021-05-31 15:19:00,102508,12.637,True,Legal
15,Lillian,Female,2016-06-05,2021-05-31 06:09:00,59414,1.256,False,Product
...,...,...,...,...,...,...,...,...
986,Donna,Female,1982-11-26,2021-05-31 07:04:00,82871,17.999,False,Marketing
989,Justin,NaN,1991-02-10,2021-05-31 16:58:00,38344,3.794,False,Legal
991,Rose,Female,2002-08-25,2021-05-31 05:12:00,134505,11.051,True,Marketing
994,George,Male,2013-06-21,2021-05-31 17:47:00,98874,4.479,True,Marketing
997,Russell,Male,2013-05-20,2021-05-31 12:39:00,96914,1.421,False,Product